In [24]:
# Deliverable 1: Collect the Data

In [4]:
import pandas as pd 
import os

student_data = os.path.join('new_full_student_data.csv')
student_df = pd.read_csv(student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [5]:
# Deliverable 2: Prepare the Data

In [6]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [7]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [12]:
student_df.duplicated().sum()

0

In [13]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [14]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [15]:
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [16]:
student_df['grade'] = student_df['grade'].str.replace('th','')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [17]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [18]:
# Deliverable 3: Summarize the Data

In [19]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [78]:
mean_math_score = student_df['math_score'].mean()
mean_math_score

64.67573326141189

In [21]:
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [22]:
# Deliverable 4: Drill Down into the Data

In [49]:
student_df.loc[:, "grade"]

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int32

In [63]:
student_df.iloc[0:3, [3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [24]:
grade_9_df = student_df.loc[student_df["grade"] == "9"]
grade_9_df.describe()

       student_id  grade  reading_score  math_score  school_budget
count         0.0    0.0            0.0         0.0            0.0
mean          NaN    NaN            NaN         NaN            NaN
std           NaN    NaN            NaN         NaN            NaN
min           NaN    NaN            NaN         NaN            NaN
25%           NaN    NaN            NaN         NaN            NaN
50%           NaN    NaN            NaN         NaN            NaN
75%           NaN    NaN            NaN         NaN            NaN
max           NaN    NaN            NaN         NaN            NaN

In [76]:
min_reading_score = student_df['reading_score'].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [35]:
dixson_reading_df = student_df.loc[student_df["school_name"] == "Dixson High School"]
dixson_reading_df

Empty DataFrame
Columns: [student_id, student_name, grade, school_name, reading_score, math_score, school_type, school_budget]
Index: []

In [38]:
min_reading_score = student_df['reading_score'].min()
min_reading_score_11 = student_df.loc[student_df["grade"] == "11"]
min_reading_score_11

Empty DataFrame
Columns: [student_id, student_name, grade, school_name, reading_score, math_score, school_type, school_budget]
Index: []

In [39]:
min_reading_score = student_df['reading_score'].min()
min_reading_score_12 = student_df.loc[student_df["grade"] == "12"]
min_reading_score_12

Empty DataFrame
Columns: [student_id, student_name, grade, school_name, reading_score, math_score, school_type, school_budget]
Index: []

In [ ]:
# Deliverable 5: Compare the Data

In [76]:
school_type_df = student_df.groupby(["school_type"]).mean()
school_type_df.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [75]:
avg_by_school = student_df.groupby(['school_type', 'grade']).mean()
avg_by_school.loc[:, ["math_score"]]

                   math_score
school_type grade
Charter     9       70.077874
            10      66.443206
            11      68.024735
            12      60.212121
Public      9       63.771066
            10      63.764121
            11      59.314337
            12      63.568319

In [ ]:
# Deliverable 6: Report Findings 
# Based on the data set, Charter Schools have higher average math test scores across grades 9, 10 and 11 while 12th graders from Public schools are testing higher. 
# It should also be noted that based upon the data set Charter schools have a lower yearly school budget than Public schools on average.